IdeaRS.OpenModel.Connection.ConnectionCheckRes
Results for connection in project

IdeaRS.OpenModel.Connection.ConnectionCheckRes.#ctor


IdeaRS.OpenModel.Connection.ConnectionCheckRes.CheckResSummary
List of CheckResSummary

IdeaRS.OpenModel.Connection.ConnectionCheckRes.CheckResPlate
List of check results for plates

IdeaRS.OpenModel.Connection.ConnectionCheckRes.CheckResWeld
List of check results for welds

IdeaRS.OpenModel.Connection.ConnectionCheckRes.CheckResBolt
List of check results for bolts

IdeaRS.OpenModel.Connection.ConnectionCheckRes.CheckResAnchor
List of check results for anchors

IdeaRS.OpenModel.Connection.ConnectionCheckRes.CheckResConcreteBlock
List of check results for concrete blocks

IdeaRS.OpenModel.Connection.ConnectionCheckRes.Name
Name of connection

IdeaRS.OpenModel.Connection.ConnectionCheckRes.ConnectionID
Guid of connection

IdeaRS.OpenModel.Connection.ConnectionCheckRes.Messages
Gets or sets the list of errors, that apears during validation and/or calculation.